//
// for win32
//
#define _STRING_RES_

#include "Common.h"
#ifdef WIN32
#include "StringGBK.h"
#else
#include "StringUTF8.h"
#endif

// 
// 角色昵称生成器 
// 文件 utf8 编码  
//

USING_NS_CC;

// 姓氏管理 
 
static int SUR_NAME_RATE[] = { 0, 21, 47, 62, 85 };
static char *SUR_NAMES[] = {
	// 3 个最常见的姓，各占全国人口约 7%，总共约 21% 
 
	"王_李_张_", 
	// 7 个姓，各占全国人口约 3.86%，总共占 27% 
 
	"刘_陈_杨_黄_赵_吴_周_", 
	// 12 个姓，各占全国人口约 1.15%，总共占 14% 
 
	"徐_孙_马_朱_胡_郭_何_高_林_罗_郑_梁_", 
	// 78 个姓，总共占 23% 
 
	"谢_宋_唐_许_韩_冯_邓_曹_彭_曾_肖_田_董_袁_潘_于_蒋_蔡_余_杜_叶_程_苏_魏_吕_丁_任_沈_姚_卢_"
	"姜_崔_钟_谭_陆_汪_范_金_石_廖_贾_夏_韦_傅_方_白_邹_孟_熊_秦_邱_江_尹_薛_闫_段_雷_侯_龙_史_"
	"陶_黎_贺_顾_毛_郝_龚_邵_万_钱_严_覃_武_戴_莫_孔_向_汤_",
	// 其它许多的姓，总共占 15%	 
 
	"诸_卫_尤_施_华_戚_喻_柏_水_窦_章_云_葛_奚_郎_鲁_昌_苗_凤_花_俞_柳_酆_鲍_费_廉_岑_倪_滕_殷_"
	"毕_邬_安_常_乐_时_皮_卡_齐_康_伍_元_卜_平_和_穆_萧_堪_祁_禹_狄_米_贝_明_臧_计_伏_成_谈_茅_"
	"庞_纪_舒_屈_项_祝_粱_阮_蓝_闵_席_季_麻_强_路_娄_危_童_颜_梅_盛_刁_骆_樊_凌_霍_虞_支_柯_咎_"
	"管_经_房_裘_缪_干_解_应_宗_宣_贲_郁_单_杭_洪_包_诸_左_吉_钮_嵇_邢_滑_裴_荣_翁_荀_羊_於_惠_"
	"甄_魏_家_封_芮_羿_储_靳_汲_邴_糜_松_井_富_巫_乌_焦_巴_弓_牧_隗_山_谷_车_宓_蓬_全_郗_班_仰_"
	"秋_仲_伊_宫_宁_仇_栾_暴_甘_钭_厉_戎_祖_符_景_詹_束_幸_司_韶_郜_蓟_薄_印_宿_怀_蒲_台_从_鄂_"
	"索_咸_籍_赖_卓_蔺_屠_蒙_池_乔_阴_郁_胥_能_苍_双_闻_莘_党_翟_贡_劳_逄_姬_申_扶_堵_冉_宰_郦_"
	"雍_卻_璩_桑_桂_濮_牛_寿_通_边_扈_燕_冀_郏_浦_尚_农_温_别_庄_晏_柴_翟_阎_充_慕_连_茹_习_宦_"
	"艾_鱼_容_古_易_慎_戈_庚_终_暨_居_衡_步_都_耿_满_弘_匡_国_文_寇_广_禄_阙_东_殴_殳_沃_利_蔚_"
	"越_夔_隆_师_巩_厍_聂_晁_勾_敖_融_冷_訾_辛_阚_那_简_饶_空_毋_沙_乜_养_鞠_须_丰_巢_关_蒯_相_"
	"查_后_荆_红_游_竺_权_逯_盖_後_桓_公_万俟_司马_上官_欧阳_夏侯_诸葛_闻人_东方_赫连_皇甫_尉迟_公羊_澹台_公冶_宗政_濮阳_"
	"淳于_单于_太叔_申屠_公孙_仲孙_轩辕_令狐_钟离_宇文_长孙_慕容_鲜于_闾丘_司徒_司空_亓官_司寇_仉督_子车_"
	"颛孙_端木_巫马_公西_漆_雕_乐正_壤驷_公良_拓拔_夹谷_宰父_谷粱_晋_楚_法_汝_鄢_涂_钦_"
	"段干_百里_东郭_南门_呼延_归海_羊舌_微生_岳_帅_缑_亢_况_后_有琴_丘_左丘_东门_西门_商_"
	"牟_佘_佴_伯_赏_南宫_墨_哈_谯_笪_年_爱_阳_佟_第五_言_福_",
	0};

static char* FIRST_NAMES[] = {
	"安_昂_奥_霸_白_柏_百_邦_宝_保_北_贝_备_本_标_彪_斌_宾_滨_兵_冰_炳_丙_秉_波_博_勃_采_才_材_"
	"财_灿_昌_长_常_畅_朝_超_潮_辰_晨_城_承_成_乘_诚_盛_炽_重_冲_充_川_春_纯_聪_大_达_丹_道_导_"
	"德_登_迪_笛_典_定_丁_顶_东_冬_栋_斗_端_敦_顿_恩_发_法_凡_方_飞_奋_风_枫_锋_峰_丰_富_福_复_"
	"刚_钢_岗_冈_纲_高_格_戈_根_功_工_公_弓_共_宫_谷_古_固_冠_官_关_观_光_广_贵_桂_圭_过_国_果_"
	"海_汉_行_航_杭_号_好_浩_昊_豪_和_合_禾_河_恒_红_洪_弘_宏_鸿_湖_虎_华_化_花_欢_幻_辉_惠_慧_"
	"晖_恢_火_基_极_机_吉_集_继_纪_济_佳_加_甲_嘉_建_健_剑_坚_俭_江_洁_杰_介_捷_金_进_晋_锦_劲_"
	"经_井_京_景_静_精_净_敬_靖_炯_久_举_君_军_均_俊_钧_骏_开_锴_凯_楷_康_亢_克_可_科_匡_奎_魁_"
	"逵_昆_来_浪_郎_朗_劳_乐_雷_磊_礼_理_利_力_立_黎_历_励_厉_联_连_炼_涟_琏_良_亮_列_烈_林_临_"
	"霖_麟_灵_翎_陵_柳_龙_隆_岭_凌_路_伦_仑_洛_络_迈_麦_茂_矛_毛_美_梦_米_密_民_敏_明_名_木_南_"
	"男_楠_能_年_宁_牛_农_湃_佩_培_鹏_蓬_朋_品_平_普_浦_朴_其_奇_七_齐_启_旗_琦_乾_谦_强_桥_勤_"
	"秦_琴_钦_清_庆_青_秋_渠_全_权_泉_荃_群_人_仁_融_荣_容_镕_如_儒_瑞_锐_睿_润_森_山_善_杉_上_"
	"尚_商_绍_少_社_深_神_胜_升_生_声_省_盛_圣_时_石_实_世_师_诗_士_始_史_狮_适_仕_式_守_首_寿_"
	"书_树_术_舒_述_枢_帅_爽_双_霜_顺_硕_烁_思_司_松_颂_嵩_苏_速_肃_太_泰_坦_唐_堂_棠_涛_韬_焘_"
	"滔_腾_天_田_铁_庭_挺_廷_亭_霆_同_通_铜_童_统_桐_图_土_途_娃_万_旺_维_伟_威_卫_唯_炜_巍_玮_"
	"纬_拓_文_闻_武_梧_西_希_喜_习_峡_侠_献_贤_显_宪_仙_祥_相_翔_小_晓_孝_霄_逍_信_新_心_鑫_歆_"
	"兴_星_雄_秀_旭_续_绪_宣_轩_玄_学_雪_寻_训_逊_勋_循_迅_亚_雅_言_岩_延_彦_炎_焱_阳_扬_洋_耀_"
	"业_野_烨_晔_一_亿_义_意_易_毅_益_翼_逸_谊_银_英_迎_映_赢_鹰_永_勇_涌_咏_有_友_右_游_优_尤_"
	"佑_幽_悠_攸_鱼_玉_宇_雨_育_语_裕_预_渔_羽_郁_誉_瑜_煜_昱_元_原_远_源_渊_月_越_跃_岳_云_运_"
	"允_赞_泽_则_增_曾_占_战_展_章_长_丈_彰_璋_兆_照_昭_钊_哲_镇_真_震_振_正_政_争_征_铮_峥_之_"
	"至_志_治_知_直_值_致_智_植_中_重_忠_仲_钟_周_州_洲_舟_宙_昼_主_竹_柱_庄_壮_准_卓_子_自_宗_"
	"纵_祖_尊_遵_佐_珍_",
	"阿_艾_岸_傲_澳_敖_八_巴_拔_伯_班_榜_葆_豹_苞_雹_倍_碑_倍_碚_奔_必_笔_碧_毕_壁_璧_弼_扁_变_"
	"边_汴_表_飚_飙_别_彬_匕_秘_辟_槟_濒_缤_并_屏_槟_薄_播_卜_泊_铂_渤_魄_布_步_晡_参_璨_粲_仓_"
	"藏_苍_沧_查_察_柴_产_禅_蟾_单_尝_车_彻_澈_臣_尘_宸_程_呈_澄_丞_晟_赤_池_尺_持_翅_驰_弛_崇_"
	"畴_筹_俦_酬_初_处_楚_储_出_杵_雏_传_创_窗_闯_吹_垂_锤_淳_醇_椿_绰_此_词_辞_丛_从_粹_璀_催_"
	"村_存_寸_措_带_代_岱_当_岛_焘_得_灯_地_第_帝_镝_谛_电_殿_滇_巅_雕_貂_叠_鼎_町_董_都_读_度_"
	"杜_独_毒_渡_督_锻_椴_对_兑_盾_惇_俄_峨_锷_筏_范_翻_繁_帆_泛_番_幡_藩_房_芳_坊_非_斐_沸_霏_"
	"翡_蜚_分_汾_封_奉_凤_逢_烽_服_伏_夫_府_负_甫_孚_阜_父_附_符_赋_抚_驸_盖_甘_敢_赣_港_罡_镐_"
	"皋_歌_阁_革_舸_亘_艮_更_耕_庚_赓_贡_恭_钩_构_勾_股_故_鼓_贯_纶_归_规_轨_鬼_龟_亥_含_邯_翰_"
	"寒_函_罕_晗_焓_沆_皓_毫_鹤_荷_黑_痕_衡_横_虹_泓_厚_后_侯_猴_胡_沪_扈_狐_浒_琥_骅_桦_怀_淮_"
	"槐_环_焕_桓_黄_荒_皇_晃_湟_煌_凰_会_回_灰_徽_珲_魂_混_获_活_几_级_积_季_际_其_籍_绩_冀_忌_"
	"激_疾_寂_骥_蓟_家_稼_伽_迦_间_肩_渐_见_监_舰_剪_鉴_简_箭_践_涧_骞_将_降_疆_交_教_角_焦_觉_"
	"礁_郊_骄_蛟_校_峤_戒_劫_阶_界_节_街_解_结_津_今_谨_禁_斤_竟_警_镜_境_睛_泾_菁_鲸_旌_九_酒_"
	"究_巨_居_聚_驹_榘_隽_绝_觉_爵_铠_柯_珂_轲_肯_铿_空_哙_宽_狂_坤_琨_鲲_阔_廓_括_腊_莱_岚_澜_"
	"览_斓_琅_老_里_犁_藜_栗_厘_笠_栎_链_濂_镰_谅_梁_凉_辽_僚_潦_冽_邻_令_零_龄_棱_留_流_楼_鲁_"
	"陆_录_庐_橹_潞_虏_禄_旅_律_峦_略_轮_纶_罗_麻_脉_蛮_芒_莽_蟒_氓_瑁_卯_枚_蒙_孟_盟_猛_萌_迷_"
	"泌_绵_棉_冕_勉_苗_淼_闽_旻_鸣_铭_茗_魔_墨_摩_默_谋_牧_慕_目_沐_耐_奈_念_凝_蟠_滂_炮_沛_霈_"
	"辟_丕_颇_坡_魄_珀_谱_棋_期_器_麒_杞_骐_前_钱_黔_潜_佥_锵_晴_卿_穷_穹_求_球_虬_丘_逑_俅_染_"
	"然_让_忍_刃_韧_壬_日_戎_嵘_孺_若_萨_飒_三_僧_鲨_陕_笙_晟_矢_十_是_使_释_轼_峙_侍_势_授_叔_"
	"蜀_鼠_恕_殊_曙_漱_庶_戍_率_栓_水_舜_瞬_朔_四_斯_淞_宿_粟_岁_随_遂_穗_孙_笋_隼_锁_梭_塔_台_"
	"潭_檀_潼_仝_兔_团_疃_屯_皖_王_魏_蔚_渭_畏_崴_蕴_翁_沃_五_吴_无_乌_午_务_舞_雾_吾_芜_戊_恶_"
	"席_锡_溪_息_惜_曦_熹_玺_禧_昔_檄_熙_夏_黠_厦_先_险_限_乡_响_湘_厢_橡_象_笑_效_啸_潇_骁_协_"
	"邪_谐_榭_行_熊_修_休_须_虚_胥_煦_诩_栩_选_旋_铉_炫_泫_旬_巡_熏_洵_浔_崖_牙_涯_严_燕_研_颜_"
	"砚_檐_焰_淹_杨_羊_药_尧_曜_鹞_么_遥_也_叶_冶_亦_衣_乙_异_忆_沂_倚_疑_夷_奕_弈_懿_弋_翊_羿_"
	"因_印_阴_音_寅_隐_荫_吟_茵_营_婴_用_泳_庸_雍_由_忧_莜_遇_域_愈_豫_禹_渝_愚_峪_毓_禺_钰_御_"
	"聿_缘_猿_辕_粤_悦_栎_载_再_哉_藏_早_枣_责_斋_漳_嶂_肇_者_浙_拯_诤_制_峙_竺_专_锥_谆_灼_琢_"
	"茁_资_紫_仔_综_族_醉_左_",
	"霭_蔼_皑_埃_谙_盎_鳌_翱_鏖_岜_跋_灞_瀑_孛_夯_泵_荜_跸_泌_狴_陛_帛_擘_浡_礴_侪_澶_昶_苌_玚_"
	"阊_巢_焯_坼_琛_郴_宬_塍_裎_焯_柽_琤_赪_篪_螭_雠_琮_淙_嵯_炟_玳_澹_儋_棣_钿_簟_笃_梵_扉_榧_"
	"棼_葑_覆_釜_馥_涪_蚨_罘_祓_黻_黼_伽_淦_颃_杲_诰_颌_纥_暅_濯_珙_篝_缑_崮_罟_鹄_桧_癸_刿_晷_"
	"炅_邽_衮_鲧_虢_邗_撼_顸_绗_颃_灏_蒿_颢_翯_颌_翮_盍_桁_珩_蕻_竑_闳_篌_斛_笏_戽_寰_奂_萑_璜_"
	"遑_隍_麾_畿_虮_翦_戬_謇_绛_颉_玠_缙_琎_璟_炅_玖_珏_玦_恺_箜_夔_隗_岿_馗_蠡_寮_璘_旒_砻_麓_"
	"銮_雒_懋_峁_汨_缗_邈_缪_愍_鼐_磐_罴_霹_貔_璞_圃_骞_遒_璩_榷_濡_奭_澍_槊_泗_汜_菘_谡_荪_澹_"
	"惕_逖_畋_柝_隗_辒_骛_羲_绤_骧_筱_崤_燮_勰_颉_顼_烜_暅_浚_巽_衍_偃_兖_酽_剡_鞅_旸_玚_爻_鳐_"
	"繇_铘_彝_屹_镒_嶷_墉_镛_壅_猷_彧_垣_赟_瓒_奘_祯_轸_郅_骘_胄_颛_桩_奘_隹_骓_",
	0};

static char* FEMALE_NAMES[] = {
	"爱_艾_安_白_宝_贝_蓓_碧_璧_缤_玢_冰_屏_采_彩_钗_蝉_蟾_畅_嫦_裳_辰_晨_钏_春_纯_淳_聪_翠_黛_"
	"丹_珰_娣_蝶_玎_娥_萼_婀_帆_方_芳_菲_飞_妃_绯_芬_粉_纷_玢_枫_凤_馥_芙_歌_格_鸽_庚_桂_瑰_闺_"
	"果_帼_好_皓_和_禾_鹤_荷_红_鸿_虹_泓_华_花_画_环_欢_浣_凰_惠_慧_晖_蕙_卉_彗_吉_姬_佳_嘉_珈_"
	"江_娇_骄_皎_姣_洁_姐_婕_金_锦_瑾_堇_槿_静_净_敬_晶_菁_婧_靓_菊_娟_绢_鹃_可_珂_兰_澜_斓_蕾_"
	"丽_莉_鹂_俪_莲_琳_林_灵_玲_菱_翎_柳_榴_露_璐_珞_曼_蔓_缦_美_妹_梅_湄_媚_眉_玫_莓_嵋_梦_蜜_"
	"咪_绵_苗_妙_敏_明_茗_娜_楠_囡_妮_宁_妞_女_暖_鸥_藕_飘_平_萍_屏_苹_琦_琪_其_祺_淇_绮_倩_千_"
	"茜_芊_巧_俏_琴_芹_情_青_晴_卿_箐_琼_秋_雀_鹊_裙_蓉_榕_柔_如_茹_瑞_蕊_若_莎_纱_珊_姗_裳_芍_"
	"诗_淑_爽_双_霜_水_灿_思_丝_素_糖_桃_甜_恬_亭_汀_婷_葶_童_娃_婉_宛_琬_蔚_薇_文_雯_舞_喜_茜_"
	"霞_仙_娴_贤_湘_香_笑_小_晓_新_心_欣_星_幸_杏_秀_绣_璇_萱_瑄_绚_雪_珣_雅_娅_丫_燕_艳_雁_颜_"
	"妍_嫣_瑶_杳_伊_仪_宜_依_艺_衣_怡_颐_漪_茵_银_音_荫_赢_英_迎_影_颖_瑛_盈_婴_莹_樱_莺_颍_滢_"
	"缨_荧_萤_嬴_璎_鹦_优_尤_悠_玉_雨_毓_瑜_圆_媛_沅_瑗_爰_月_钰_元_悦_玥_云_韵_蕴_芸_昭_真_珍_"
	"臻_贞_枝_织_芝_稚_芷_朱_珠_琢_紫_姿_",
	"暧_嫒_芭_北_彬_璨_宸_郴_承_诚_莼_璁_璀_荻_俄_翡_霏_逢_沣_蚨_茯_莞_涫_琯_涵_菡_诃_痕_衡_蘅_"
	"鹄_瑚_鬟_珲_荟_霁_笄_葭_笕_蕉_狡_茭_鲛_佼_桔_睫_睛_隽_君_筠_蔻_葵_坤_岚_蓝_利_力_立_骊_郦_"
	"俐_恋_良_霖_凌_铃_羚_苓_绫_泠_鹿_芦_鹭_潞_鸾_罗_萝_漫_蛮_魅_枚_萌_棉_溟_眸_腩_霓_尼_凝_侬_"
	"葩_盼_佩_瓶_娉_蒲_莆_杞_骐_棋_颀_仟_纤_蔷_嫱_沁_螓_勍_娆_荣_睿_飒_施_漱_姝_妁_斯_鸶_苏_檀_"
	"昙_棠_窕_桐_彤_橦_兔_娲_晚_弯_绾_纨_惋_莞_汶_雾_芜_妩_西_溪_惜_曦_禧_皙_夏_瑕_暇_鲜_弦_襄_"
	"霄_潇_绡_鑫_馨_芯_昕_忻_袖_岫_琇_絮_宣_暄_喧_旋_迅_薰_亚_玡_言_烟_岩_研_琰_滟_胭_阳_扬_杨_"
	"羊_鸯_洋_遥_钥_窈_徭_珧_叶_意_易_亦_忆_逸_沂_饴_猗_因_隐_映_瀛_萦_蓥_咏_泳_友_幽_莜_鱼_育_"
	"羽_郁_渝_誉_源_园_苑_鸢_芫_鸳_嫚_原_缘_越_乐_韫_纭_桢_蓁_榛_浈_溱_筝_知_直_智_雉_洲_舟_竹_"
	"竺_卓_镯_孜_梓_醉_妆_",
	"霭_蔼_瑷_荜_玚_琛_茈_苁_莪_莩_菔_珩_荭_缳_蒹_茳_妗_荩_莙_蓼_袂_艿_颦_荠_萁_欹_芩_茕_萩_纾_"
	"姒_苕_畹_璺_鹜_遐_谖_晏_玚_旸_荛_旖_荑_薏_楹_潆_萸_湲_箢_蕰_簪_贽_苎_",
	0};
// 名字管理 
 
static int FIRST_NAME_RATE[][3] = {
	{ 0, 70, 100, },
	{ 0, 70, 100, },
	{ 0, 70, 100, },
	{ 0, 70, 100, },
	{ 0, 50, 90, },
	{ 0, 50, 90, }};
	
static std::string SurName()
{
	std::string name;
	int i1, i2;
	i1 = random() % 100;
	i2 = sizeof(SUR_NAME_RATE)/sizeof(int);
	while (i2 > 0)
	{
		i2 --;
		if (i1 >= SUR_NAME_RATE[i2]) 
		{
			char *p = SUR_NAMES[i2];
			char buf[8] = {0};
			i1 = random() % (strlen(p)-2);
			if(i1 > 3)
			{
				p += i1;
				while(i1>0 && p[-1] && p[-1] != '_')p--,i1--;
			}
			int k = 0;
			while(*p && *p != '_')
				buf[k++] = *p++;

			name = buf;
			break;
		}
	}
	return name;
}


static std::string FirstName(int gender, int social_class)
{
	int i1, i2, i3;
	std::string s1;
	i3 = random() % 2;
	while (i3 >= 0)
	{
		i3 --;
		i1 = random() % 100;
		i2 = 3;	//sizeof(FIRST_NAME_RATE[social_class]);
		while (i2 > 0)
		{
			i2 --;
			if (i1 >= FIRST_NAME_RATE[social_class][i2]) 
				break;
		}
		char *p;
		char buf[8] = {0};

		p = (gender == 2)?FEMALE_NAMES[i2]:FIRST_NAMES[i2];

		int k = random() % strlen(p);
		if(k > 3)
		{
			p += k;
			while(k>0 && p[-1] && p[-1] != '_')k--,p--;
		}
		k = 0;
		while(*p && *p != '_')
			buf[k++] = *p++;

		s1 += buf;
	}
	return s1;
}

std::string genRoleName(int gender)
{
	int social_class = 5;
	std::string roleName = SurName();
	roleName += FirstName(gender, social_class);

	return roleName;
}

